# PipeRoughness Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..PipeRoughness Property
ParameterTypeId Class See Also
---
"Roughness"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId PipeRoughness { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property PipeRoughness As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ PipeRoughness {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace